var a = 1, b = 1, c, d;
c = ++a; alert(c);         // 2 - Изначально в переменной а значение 1, потом происходит увеличение значения на один, и в
                           // переменной теперь хранится значение 2, и форма записи префиксная и сразу выводит значение 2 для пременной с
d = b++; alert(d);         // 1 - Так как форма постфиксная, было выведено сразу значение 1,
                           // которое было записано в переменной b, и в самой переменной значение становится 2
c = (2+ ++a); alert(c);    // 5 - Здесь до начала операции в переменной а уже было значение 2, за счет префиксной формы одновременно и
                           // значение увеличивается на 1 и в выводе идет уже увеличенное значение, поэтому к 2 прибавляем 3
d = (2+ b++); alert(d);    // 4 - Здесь до начала операции в переменной b уже было значение 2, за счет префиксной формы значение
                           // увеличивается на 1 в операторе b++, но в вывод идет значение 2, поэтому к 2 прибавляем 2
alert(a);                  // 3 - Было две операции на увеличение значения переменной, поэтому и имеем значение 3, так как обычный вывод,
                           // то и выводим явное значение переменной
alert(b);                  // 3 - каждая операция над b в предыдущих выражения, где
                           // использовалось b++ давало увеличение на 1, следовательно так как изначально b равнялась 1,
                           // то спустя два прибавления она и стала иметь значение 3
