/* При возможностях данного урока для каждой сущности "Продукт" нужно будет
определять свою переменную, но можно заранее продумать какие у объекта будут
свойства и методы. И для любого созданного объекта, если необходимо, можно
добавить или удалить свойство или метод, и это действие никакой из созданных
ранее объектов не затронет.
Но созданных объектов будет много и в общем-то они будут никак независимы
друг от друга, формально только разработчик соблюдает их структуру.
Если для сущности "Продукт" создать класс, то также можно предусмотреть для
каждой сущности этого класса набор свойств и базовых методов. Но при необходимости
внесения изменений в конкретные сущности, придется изменять и конструктор или
прототип класса, я в этом пока не разбираюсь.
Зато имея классы, легко дополняешь или изменяешь конструктор (или прототип)
и все объекты начинают обладать этими новыми свойствами или методами. */
